coanda/110kpa/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    down
    {
        type            symmetryPlane;
    }

    right
    {
        type            fixedValue;
        value           uniform 100000;
    }

    up
    {
        type            symmetryPlane;
    }

    meanFlow
    {
        type            fixedValue;
        value           uniform 100000;
    }

    surface
    {
        type            zeroGradient;
    }
    coandaInlet
    {
        type            totalPressure;
        value           uniform 110000;
        p0              uniform 110000;
    }

    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
